#### Min-Max Scaling (Normalization)
 =>Scales the data to a fixed range, usually [0, 1].
#### Formula:
   X'=(X-min(X))/max(X)-min(x)
#### When to use:
  => When the data has known bounds and is non-Gaussian.

#### Suitable for algorithms sensitive to feature magnitudes, such as:

1 k-Nearest Neighbors (kNN)
2 Support Vector Machines (SVM)
3 Neural Networks

In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler

### using pandas

In [21]:
# Sample data
data1 = {'Age': [25, 30, 35, 40, 45],
        'Salary': [30000, 50000, 70000, 90000, 110000]}
df1 = pd.DataFrame(data1)
df1

   Age  Salary
0   25   30000
1   30   50000
2   35   70000
3   40   90000
4   45  110000

In [27]:
df1["scaled_Age"]=(df1['Age']-df1['Age'].min())/(df1['Age'].max()-df1['Age'].min())
df1['scaled_salary']=(df1['Salary']-df1['Salary'].min())/(df1['Salary'].max()-df1['Salary'].min())
df1

   Age  Salary  scaled_Age  scaled_salary
0   25   30000        0.00           0.00
1   30   50000        0.25           0.25
2   35   70000        0.50           0.50
3   40   90000        0.75           0.75
4   45  110000        1.00           1.00

### using sklearn

In [3]:
# Sample data
data = {'Feature1': [10, 20, 30, 40, 50], 
        'Feature2': [1, 2, 3, 4, 5]}
df=pd.DataFrame(data)
df

   Feature1  Feature2
0        10         1
1        20         2
2        30         3
3        40         4
4        50         5

In [7]:
# min-max scaling
scalar=MinMaxScaler()
normalized_data=scalar.fit_transform(df)
normalized_df=pd.DataFrame(data=normalized_data,columns=df.columns)
normalized_df

   Feature1  Feature2
0      0.00      0.00
1      0.25      0.25
2      0.50      0.50
3      0.75      0.75
4      1.00      1.00

### exmple 2

In [16]:
data2 = {
    'Age': [18, 25, 30, 35, 40],
    'Salary': [20000, 35000, 50000, 60000, 80000],
    'Credit_Score': [500, 600, 700, 800, 900]
}
df2=pd.DataFrame(data2)
df2

   Age  Salary  Credit_Score
0   18   20000           500
1   25   35000           600
2   30   50000           700
3   35   60000           800
4   40   80000           900

In [18]:
# scale the feature
scaler=MinMaxScaler()
scaled_data=scaler.fit_transform(df2)
scaled_df=pd.DataFrame(data=scaled_data,columns=df2.columns)
scaled_df

        Age    Salary  Credit_Score
0  0.000000  0.000000          0.00
1  0.318182  0.250000          0.25
2  0.545455  0.500000          0.50
3  0.772727  0.666667          0.75
4  1.000000  1.000000          1.00